Repository: jrbasso/migrations
Catalog: Locale/*/LC_MESSAGES/migrations.po
Languages: pt_br

source: Model ":model" not exists.
pt_br: Model ":model" não existe.

source: Creating table ":table"...
pt_br: Criando tabela ":table"...

source: Dropping table ":table"...
pt_br: Apagando tabela ":table"...

source: Creating column ":column"...
pt_br: Criando coluna ":column"...

source: Removing column ":column"...
pt_br: Removendo coluna ":column"...

source: Changing column ":column"...
pt_br: Alterando coluna ":column"...

source: column not found.
pt_br: coluna não encontrada.

source: Renaming column ":old" to ":new"...
pt_br: Renomeando coluna ":old" por ":new"...

source: > Method ":method" not implemented. Skipping...
pt_br: > Método ":method" não implementado. Pulando...

source: Nothing installed.
pt_br: Nada instalado.

source: m/d/Y H:i:s
pt_br: d/m/Y H:i:s

source: Path to migrations classes: :path
pt_br: Caminho das classes de migrations: :path

source: Connection to the database: :connection
pt_br: Conexão com a base de dados: :connection

source: Last migration installed: :date
pt_br: Último migration instalado: :date

source: Your datasource is not supported.
pt_br: Seu datasource não é suportado.

source: Date must be in format YYYYMMDDHHMMSS.
pt_br: A data deve estar no formato AAAAMMDDHHMMSS.

source: Executing file :file...
pt_br: Executando arquivo :file...

source: Can not be execute :class (:date).
pt_br: Não pode executar :class (:date).

source: All updated.
pt_br: Tudo atualizado.

source: No version installed.
pt_br: Nenhuma versão instalada.

source: Date is needed or input "last" to revert the last up.
pt_br: A data é necessária ou entrar com "last" para reverter o último up.

source: Executing down of :migration (:date)...
pt_br: Executando down de :migration (:date)...

source: Error in down.
pt_br: Erro no down.

source: All down.
pt_br: Tudo revertido.

source: Can not execute drop of all tables.
pt_br: Não pode executar o drop de todas tabelas.

source: Resetted.
pt_br: Reiniciado.

source: Let me know the name of migration ...
pt_br: Deixe-me saber o nome do migration...

source: I did not find that your template ...
pt_br: Eu não pude encontrar o seu template...

source: Oops, did not write the migration!
pt_br: Oops, não escrevi seu migration!

source: Migration created successfully!
pt_br: Migration criado com sucesso!

source: Go and update the method UP and DOWN
pt_br: Vá e atualize os métodos UP and DOWN.

source: The file is in: :file
pt_br: O arquivo está em: :file

source: Specified path does not exist.
pt_br: O diretório especificado não existe.

source: Creates the following directory: :path
pt_br: Crie o seguinte diretório: :path

source: File ":file" can not be read. Check if exists or have privileges for your user.
pt_br: Arquivo ":file" não pode ser lido. Verifique se existe e tem privilégios para seu usuário.

source: The class :classname not in file.
pt_br: A classe :classname não está no arquivo.

source: Class :classname not extends Migration.
pt_br: Classe :classname não herda Migration.

source: Schema table ":tablename" can not be created.
pt_br: Esquema de ":tablename" não pode ser criada.

source: Schema table ":tablename" created.
pt_br: Esquema de ":tablename" criada.

source: Usage: cake migration <command> <arg1> <arg2>...
pt_br: Use: cake migration <comando> <arg1> <arg2>...

source: Params: -connection <config> set db config <config>. Uses 'default' if none is specified. -path <dir> path <dir> to read and write migrations scripts. default path: :path
pt_br: Parâmetros: -connection <config> seta a configuração de banco de dados. Usa 'default' se não informado. -path <dir> diretório <dir> para ler e escrever os scripts de migrations. caminho padrão: :path

source: Commands: migration help shows this help message. migrations create <name> create a migration script. migration up [date] upgrade database to specified date. If the date is not specified, latest is used. Date must be in format YYYYMMDDHHMMSS. migration down <date> downgrade database to specified date. Date must be in format YYYYMMDDHHMMSS. migration reset execute down of all migrations. If param -force is used, this will drop all tables in database that exist. migration rebuild execute a reset an up actions. Param -force can be used.
pt_br: Comandos: migration help mostra esta mensagem de ajuda. migration create <nome> cria um script de migration. migration up [data] atualiza o banco de dados até a data informada. Se a data não for informada, a última será utilizada. A data deve estar no formato AAAAMMDDHHMMSS. migration down <date> volta o banco de dados para a data especificada. A data deve estar no formato AAAAMMDDHHMMSS. migration reset executa o down de todos migrations. Se o parâmetro -force for usado, irá apagar todas as tabelas existentes no banco de dados. migration rebuild executa o reset e um up. O parâmetro -force pode ser utilizado.
